Белгипрозем_2017/src/InformationRegisters/ТекущиеСостоянияДокументов/ТекущиеСостоянияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеСостоянияДокументов</name>
  <resources>
    <name>УдалитьСостояние</name>
    <type>
      <types>EnumRef.СостоянияДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>BusinessProcessRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/СостоянияДокументов/СостоянияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументов</name>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Рассмотрен</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Исполнен</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>НеУтвержден</name>
  </enumValues>
  <enumValues>
    <name>НаРегистрации</name>
  </enumValues>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>НеЗарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>НаПодписании</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/InformationRegisters/ТекущиеСостоянияДокументов/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтегрированныеСистемы = ОбработкаЗапросовXDTOПовтИсп.ПолучитьУзлыОбменаИнтегрированныхСистем();
	
	СостоянияСогласования = Новый Массив;
	СостоянияСогласования.Добавить(Перечисления.СостоянияДокументов.НаСогласовании);
	СостоянияСогласования.Добавить(Перечисления.СостоянияДокументов.Согласован);
	СостоянияСогласования.Добавить(Перечисления.СостоянияДокументов.НеСогласован);
	
	Для каждого Запись Из ЭтотОбъект Цикл
		// При необходимости создадим наборы записей для регистрации по ведущим измерениям.
		Если СостоянияСогласования.Найти(Запись.Состояние) <> Неопределено Тогда
			НаборЗаписей = РегистрыСведений.ТекущиеСостоянияДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Запись.Документ);
			НаборЗаписей.Отбор.Состояние.Установить(Запись.Состояние);
		Иначе
			НаборЗаписей = Неопределено;
		КонецЕсли;
		Для каждого Узел Из ИнтегрированныеСистемы Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Запись.Документ);
			Если НаборЗаписей <> Неопределено Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписей);
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры

#КонецЕсли
